Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [3]:
data = [4,8,15,16,23,42]

In [6]:
pd_series = pd.Series(data)

In [8]:
print(pd_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [9]:
l = [ i for i in range(0,11)]

In [11]:
l_series = pd.Series(l)

In [12]:
l_series[0]

0

In [13]:
type(l_series)

pandas.core.series.Series

In [16]:
l_series.dtype

dtype('int64')

In [17]:
l_series.head(2)

0    0
1    1
dtype: int64

In [18]:
l_series.tail(3)

8      8
9      9
10    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [19]:
data = {'Name':['Alice','Bob','Claire'],
       'Age':[25,30,27],
       'Gender':['Female','Male','Female']}

In [20]:
df = pd.DataFrame(data)

In [21]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

ANS :
    
A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.
Pandas is combination of series 

Series is a one-dimensional array holding data of any type.
series is just like python list

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

ANS :

1) head()
2) tail()
3) dtype()
4) loc()
5) iloc()
6) insert()
7) columns

In [23]:
df1 = pd.read_csv('services.csv')

In [24]:
df1.head(3)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN
2,3,3,NaN,NaN,NaN,Phone for information (403-4300 Ext. 4322).,Older adults age 55 or over who can benefit fr...,Offers supportive counseling services to San M...,Resident of San Mateo County age 55 or over,NaN,...,NaN,"Geriatric Counseling, Older Adults, Gay, Lesbi...",NaN,Senior Peer Counseling,NaN,San Mateo County,active,Varies.,NaN,NaN

In [25]:
df1.tail(3)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
20,21,21,NaN,NaN,NaN,By phone during business hours.,NaN,just a test service,NaN,NaN,...,NaN,NaN,NaN,Service for Admin Test Location,NaN,San Mateo County,inactive,NaN,NaN,NaN
21,22,22,NaN,"Cash, Check, Credit Card",Fotos para pasaportes,Walk in or apply by phone or mail,"Profit and nonprofit businesses, the public, m...",[NOTE THIS IS NOT A REAL SERVICE--THIS IS FOR ...,None,passports@example.org,...,We offer 3-way interpretation services over th...,"Salud, Medicina",Spanish,Passport Photos,Government-issued picture identification,"Alameda County, San Mateo County",active,No wait to 2 weeks.,http://www.example.com,"105, 108, 108-05, 108-05-01, 111, 111-05"
22,23,22,NaN,NaN,NaN,Walk in or apply by phone or mail,"Second service and nonprofit businesses, the p...",[NOTE THIS IS NOT A REAL ORGANIZATION--THIS IS...,None,NaN,...,NaN,"Ruby on Rails/Postgres/Redis, testing, wic",NaN,Example Service Name,NaN,"San Mateo County, Alameda County",active,No wait to 2 weeks,http://www.example.com,NaN

In [26]:
df1.dtypes

id                           int64
location_id                  int64
program_id                 float64
accepted_payments           object
alternate_name              object
application_process         object
audience                    object
description                 object
eligibility                 object
email                       object
fees                        object
funding_sources             object
interpretation_services     object
keywords                    object
languages                   object
name                        object
required_documents          object
service_areas               object
status                      object
wait_time                   object
website                     object
taxonomy_ids                object
dtype: object

In [29]:
df1.loc[0:0]

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN

In [35]:
df1.insert(0,id,3)

In [36]:
df1.columns

Index([   <built-in function id>,                      'id',
                   'location_id',              'program_id',
             'accepted_payments',          'alternate_name',
           'application_process',                'audience',
                   'description',             'eligibility',
                         'email',                    'fees',
               'funding_sources', 'interpretation_services',
                      'keywords',               'languages',
                          'name',      'required_documents',
                 'service_areas',                  'status',
                     'wait_time',                 'website',
                  'taxonomy_ids'],
      dtype='object')

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

ANS :  
    
Series and DataFrame are mutable in nature

In [39]:
l2 = pd.Series([1,2,3,4])

In [40]:
l2[0 ]=0

In [41]:
l2

0    0
1    2
2    3
3    4
dtype: int64

In [42]:
df3 = pd.DataFrame(data)

In [43]:
df3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [46]:
df3.loc[0] = ['siddhu',21,'Male']

In [47]:
df3.head(1)

     Name  Age Gender
0  siddhu   21   Male

In [51]:
columns = pd.Series(['ID','Name','Age','Gender','City'])
row1 = pd.Series([111,'siddhu',21,'Male','Nanded'])
row2 = pd.Series([21,'athrav',16,"Male","Vanni"])
row3 = pd.Series([11,'anshul',21,'Male','nagpur'])

In [54]:
df4 = pd.DataFrame([row1,row2,row3],columns = columns)

In [55]:
df4

   ID  Name  Age  Gender  City
0 NaN   NaN  NaN     NaN   NaN
1 NaN   NaN  NaN     NaN   NaN
2 NaN   NaN  NaN     NaN   NaN